###################################################################

# Created by write_sdc on Tue Jul 28 14:26:18 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock -name vclk  -period 12  -waveform {0 6}
set_input_delay -clock vclk  0.1  [get_ports {a[13]}]
set_input_delay -clock vclk  0.1  [get_ports {a[12]}]
set_input_delay -clock vclk  0.1  [get_ports {a[11]}]
set_input_delay -clock vclk  0.1  [get_ports {a[10]}]
set_input_delay -clock vclk  0.1  [get_ports {a[9]}]
set_input_delay -clock vclk  0.1  [get_ports {a[8]}]
set_input_delay -clock vclk  0.1  [get_ports {a[7]}]
set_input_delay -clock vclk  0.1  [get_ports {a[6]}]
set_input_delay -clock vclk  0.1  [get_ports {a[5]}]
set_input_delay -clock vclk  0.1  [get_ports {a[4]}]
set_input_delay -clock vclk  0.1  [get_ports {a[3]}]
set_input_delay -clock vclk  0.1  [get_ports {a[2]}]
set_input_delay -clock vclk  0.1  [get_ports {a[1]}]
set_input_delay -clock vclk  0.1  [get_ports {a[0]}]
set_input_delay -clock vclk  0.1  [get_ports {b[13]}]
set_input_delay -clock vclk  0.1  [get_ports {b[12]}]
set_input_delay -clock vclk  0.1  [get_ports {b[11]}]
set_input_delay -clock vclk  0.1  [get_ports {b[10]}]
set_input_delay -clock vclk  0.1  [get_ports {b[9]}]
set_input_delay -clock vclk  0.1  [get_ports {b[8]}]
set_input_delay -clock vclk  0.1  [get_ports {b[7]}]
set_input_delay -clock vclk  0.1  [get_ports {b[6]}]
set_input_delay -clock vclk  0.1  [get_ports {b[5]}]
set_input_delay -clock vclk  0.1  [get_ports {b[4]}]
set_input_delay -clock vclk  0.1  [get_ports {b[3]}]
set_input_delay -clock vclk  0.1  [get_ports {b[2]}]
set_input_delay -clock vclk  0.1  [get_ports {b[1]}]
set_input_delay -clock vclk  0.1  [get_ports {b[0]}]
set_output_delay -clock vclk  0.1  [get_ports {p[13]}]
set_output_delay -clock vclk  0.1  [get_ports {p[12]}]
set_output_delay -clock vclk  0.1  [get_ports {p[11]}]
set_output_delay -clock vclk  0.1  [get_ports {p[10]}]
set_output_delay -clock vclk  0.1  [get_ports {p[9]}]
set_output_delay -clock vclk  0.1  [get_ports {p[8]}]
set_output_delay -clock vclk  0.1  [get_ports {p[7]}]
set_output_delay -clock vclk  0.1  [get_ports {p[6]}]
set_output_delay -clock vclk  0.1  [get_ports {p[5]}]
set_output_delay -clock vclk  0.1  [get_ports {p[4]}]
set_output_delay -clock vclk  0.1  [get_ports {p[3]}]
set_output_delay -clock vclk  0.1  [get_ports {p[2]}]
set_output_delay -clock vclk  0.1  [get_ports {p[1]}]
set_output_delay -clock vclk  0.1  [get_ports {p[0]}]
