###################################################################

# Created by write_sdc on Tue Jul 28 14:18:33 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock -name vclk  -period 16  -waveform {0 8}
set_input_delay -clock vclk  0.1  [get_ports {A[31]}]
set_input_delay -clock vclk  0.1  [get_ports {A[30]}]
set_input_delay -clock vclk  0.1  [get_ports {A[29]}]
set_input_delay -clock vclk  0.1  [get_ports {A[28]}]
set_input_delay -clock vclk  0.1  [get_ports {A[27]}]
set_input_delay -clock vclk  0.1  [get_ports {A[26]}]
set_input_delay -clock vclk  0.1  [get_ports {A[25]}]
set_input_delay -clock vclk  0.1  [get_ports {A[24]}]
set_input_delay -clock vclk  0.1  [get_ports {A[23]}]
set_input_delay -clock vclk  0.1  [get_ports {A[22]}]
set_input_delay -clock vclk  0.1  [get_ports {A[21]}]
set_input_delay -clock vclk  0.1  [get_ports {A[20]}]
set_input_delay -clock vclk  0.1  [get_ports {A[19]}]
set_input_delay -clock vclk  0.1  [get_ports {A[18]}]
set_input_delay -clock vclk  0.1  [get_ports {A[17]}]
set_input_delay -clock vclk  0.1  [get_ports {A[16]}]
set_input_delay -clock vclk  0.1  [get_ports {A[15]}]
set_input_delay -clock vclk  0.1  [get_ports {A[14]}]
set_input_delay -clock vclk  0.1  [get_ports {A[13]}]
set_input_delay -clock vclk  0.1  [get_ports {A[12]}]
set_input_delay -clock vclk  0.1  [get_ports {A[11]}]
set_input_delay -clock vclk  0.1  [get_ports {A[10]}]
set_input_delay -clock vclk  0.1  [get_ports {A[9]}]
set_input_delay -clock vclk  0.1  [get_ports {A[8]}]
set_input_delay -clock vclk  0.1  [get_ports {A[7]}]
set_input_delay -clock vclk  0.1  [get_ports {A[6]}]
set_input_delay -clock vclk  0.1  [get_ports {A[5]}]
set_input_delay -clock vclk  0.1  [get_ports {A[4]}]
set_input_delay -clock vclk  0.1  [get_ports {A[3]}]
set_input_delay -clock vclk  0.1  [get_ports {A[2]}]
set_input_delay -clock vclk  0.1  [get_ports {A[1]}]
set_input_delay -clock vclk  0.1  [get_ports {A[0]}]
set_input_delay -clock vclk  0.1  [get_ports {B[31]}]
set_input_delay -clock vclk  0.1  [get_ports {B[30]}]
set_input_delay -clock vclk  0.1  [get_ports {B[29]}]
set_input_delay -clock vclk  0.1  [get_ports {B[28]}]
set_input_delay -clock vclk  0.1  [get_ports {B[27]}]
set_input_delay -clock vclk  0.1  [get_ports {B[26]}]
set_input_delay -clock vclk  0.1  [get_ports {B[25]}]
set_input_delay -clock vclk  0.1  [get_ports {B[24]}]
set_input_delay -clock vclk  0.1  [get_ports {B[23]}]
set_input_delay -clock vclk  0.1  [get_ports {B[22]}]
set_input_delay -clock vclk  0.1  [get_ports {B[21]}]
set_input_delay -clock vclk  0.1  [get_ports {B[20]}]
set_input_delay -clock vclk  0.1  [get_ports {B[19]}]
set_input_delay -clock vclk  0.1  [get_ports {B[18]}]
set_input_delay -clock vclk  0.1  [get_ports {B[17]}]
set_input_delay -clock vclk  0.1  [get_ports {B[16]}]
set_input_delay -clock vclk  0.1  [get_ports {B[15]}]
set_input_delay -clock vclk  0.1  [get_ports {B[14]}]
set_input_delay -clock vclk  0.1  [get_ports {B[13]}]
set_input_delay -clock vclk  0.1  [get_ports {B[12]}]
set_input_delay -clock vclk  0.1  [get_ports {B[11]}]
set_input_delay -clock vclk  0.1  [get_ports {B[10]}]
set_input_delay -clock vclk  0.1  [get_ports {B[9]}]
set_input_delay -clock vclk  0.1  [get_ports {B[8]}]
set_input_delay -clock vclk  0.1  [get_ports {B[7]}]
set_input_delay -clock vclk  0.1  [get_ports {B[6]}]
set_input_delay -clock vclk  0.1  [get_ports {B[5]}]
set_input_delay -clock vclk  0.1  [get_ports {B[4]}]
set_input_delay -clock vclk  0.1  [get_ports {B[3]}]
set_input_delay -clock vclk  0.1  [get_ports {B[2]}]
set_input_delay -clock vclk  0.1  [get_ports {B[1]}]
set_input_delay -clock vclk  0.1  [get_ports {B[0]}]
set_output_delay -clock vclk  0.1  [get_ports {R[31]}]
set_output_delay -clock vclk  0.1  [get_ports {R[30]}]
set_output_delay -clock vclk  0.1  [get_ports {R[29]}]
set_output_delay -clock vclk  0.1  [get_ports {R[28]}]
set_output_delay -clock vclk  0.1  [get_ports {R[27]}]
set_output_delay -clock vclk  0.1  [get_ports {R[26]}]
set_output_delay -clock vclk  0.1  [get_ports {R[25]}]
set_output_delay -clock vclk  0.1  [get_ports {R[24]}]
set_output_delay -clock vclk  0.1  [get_ports {R[23]}]
set_output_delay -clock vclk  0.1  [get_ports {R[22]}]
set_output_delay -clock vclk  0.1  [get_ports {R[21]}]
set_output_delay -clock vclk  0.1  [get_ports {R[20]}]
set_output_delay -clock vclk  0.1  [get_ports {R[19]}]
set_output_delay -clock vclk  0.1  [get_ports {R[18]}]
set_output_delay -clock vclk  0.1  [get_ports {R[17]}]
set_output_delay -clock vclk  0.1  [get_ports {R[16]}]
set_output_delay -clock vclk  0.1  [get_ports {R[15]}]
set_output_delay -clock vclk  0.1  [get_ports {R[14]}]
set_output_delay -clock vclk  0.1  [get_ports {R[13]}]
set_output_delay -clock vclk  0.1  [get_ports {R[12]}]
set_output_delay -clock vclk  0.1  [get_ports {R[11]}]
set_output_delay -clock vclk  0.1  [get_ports {R[10]}]
set_output_delay -clock vclk  0.1  [get_ports {R[9]}]
set_output_delay -clock vclk  0.1  [get_ports {R[8]}]
set_output_delay -clock vclk  0.1  [get_ports {R[7]}]
set_output_delay -clock vclk  0.1  [get_ports {R[6]}]
set_output_delay -clock vclk  0.1  [get_ports {R[5]}]
set_output_delay -clock vclk  0.1  [get_ports {R[4]}]
set_output_delay -clock vclk  0.1  [get_ports {R[3]}]
set_output_delay -clock vclk  0.1  [get_ports {R[2]}]
set_output_delay -clock vclk  0.1  [get_ports {R[1]}]
set_output_delay -clock vclk  0.1  [get_ports {R[0]}]
