###################################################################

# Created by write_sdc on Tue Jul 28 15:17:42 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock [get_ports clk]  -period 14  -waveform {0 7}
set_input_delay -clock clk  0.1  [get_ports start]
set_input_delay -clock clk  0.1  [get_ports rst]
set_input_delay -clock clk  0.1  [get_ports {op1[30]}]
set_input_delay -clock clk  0.1  [get_ports {op1[29]}]
set_input_delay -clock clk  0.1  [get_ports {op1[28]}]
set_input_delay -clock clk  0.1  [get_ports {op1[27]}]
set_input_delay -clock clk  0.1  [get_ports {op1[26]}]
set_input_delay -clock clk  0.1  [get_ports {op1[25]}]
set_input_delay -clock clk  0.1  [get_ports {op1[24]}]
set_input_delay -clock clk  0.1  [get_ports {op1[23]}]
set_input_delay -clock clk  0.1  [get_ports {op1[22]}]
set_input_delay -clock clk  0.1  [get_ports {op1[21]}]
set_input_delay -clock clk  0.1  [get_ports {op1[20]}]
set_input_delay -clock clk  0.1  [get_ports {op1[19]}]
set_input_delay -clock clk  0.1  [get_ports {op1[18]}]
set_input_delay -clock clk  0.1  [get_ports {op1[17]}]
set_input_delay -clock clk  0.1  [get_ports {op1[16]}]
set_input_delay -clock clk  0.1  [get_ports {op1[15]}]
set_input_delay -clock clk  0.1  [get_ports {op1[14]}]
set_input_delay -clock clk  0.1  [get_ports {op1[13]}]
set_input_delay -clock clk  0.1  [get_ports {op1[12]}]
set_input_delay -clock clk  0.1  [get_ports {op1[11]}]
set_input_delay -clock clk  0.1  [get_ports {op1[10]}]
set_input_delay -clock clk  0.1  [get_ports {op1[9]}]
set_input_delay -clock clk  0.1  [get_ports {op1[8]}]
set_input_delay -clock clk  0.1  [get_ports {op1[7]}]
set_input_delay -clock clk  0.1  [get_ports {op1[6]}]
set_input_delay -clock clk  0.1  [get_ports {op1[5]}]
set_input_delay -clock clk  0.1  [get_ports {op1[4]}]
set_input_delay -clock clk  0.1  [get_ports {op1[3]}]
set_input_delay -clock clk  0.1  [get_ports {op1[2]}]
set_input_delay -clock clk  0.1  [get_ports {op1[1]}]
set_input_delay -clock clk  0.1  [get_ports {op1[0]}]
set_input_delay -clock clk  0.1  [get_ports {op2[30]}]
set_input_delay -clock clk  0.1  [get_ports {op2[29]}]
set_input_delay -clock clk  0.1  [get_ports {op2[28]}]
set_input_delay -clock clk  0.1  [get_ports {op2[27]}]
set_input_delay -clock clk  0.1  [get_ports {op2[26]}]
set_input_delay -clock clk  0.1  [get_ports {op2[25]}]
set_input_delay -clock clk  0.1  [get_ports {op2[24]}]
set_input_delay -clock clk  0.1  [get_ports {op2[23]}]
set_input_delay -clock clk  0.1  [get_ports {op2[22]}]
set_input_delay -clock clk  0.1  [get_ports {op2[21]}]
set_input_delay -clock clk  0.1  [get_ports {op2[20]}]
set_input_delay -clock clk  0.1  [get_ports {op2[19]}]
set_input_delay -clock clk  0.1  [get_ports {op2[18]}]
set_input_delay -clock clk  0.1  [get_ports {op2[17]}]
set_input_delay -clock clk  0.1  [get_ports {op2[16]}]
set_input_delay -clock clk  0.1  [get_ports {op2[15]}]
set_input_delay -clock clk  0.1  [get_ports {op2[14]}]
set_input_delay -clock clk  0.1  [get_ports {op2[13]}]
set_input_delay -clock clk  0.1  [get_ports {op2[12]}]
set_input_delay -clock clk  0.1  [get_ports {op2[11]}]
set_input_delay -clock clk  0.1  [get_ports {op2[10]}]
set_input_delay -clock clk  0.1  [get_ports {op2[9]}]
set_input_delay -clock clk  0.1  [get_ports {op2[8]}]
set_input_delay -clock clk  0.1  [get_ports {op2[7]}]
set_input_delay -clock clk  0.1  [get_ports {op2[6]}]
set_input_delay -clock clk  0.1  [get_ports {op2[5]}]
set_input_delay -clock clk  0.1  [get_ports {op2[4]}]
set_input_delay -clock clk  0.1  [get_ports {op2[3]}]
set_input_delay -clock clk  0.1  [get_ports {op2[2]}]
set_input_delay -clock clk  0.1  [get_ports {op2[1]}]
set_input_delay -clock clk  0.1  [get_ports {op2[0]}]
set_output_delay -clock clk  0.1  [get_ports {result[30]}]
set_output_delay -clock clk  0.1  [get_ports {result[29]}]
set_output_delay -clock clk  0.1  [get_ports {result[28]}]
set_output_delay -clock clk  0.1  [get_ports {result[27]}]
set_output_delay -clock clk  0.1  [get_ports {result[26]}]
set_output_delay -clock clk  0.1  [get_ports {result[25]}]
set_output_delay -clock clk  0.1  [get_ports {result[24]}]
set_output_delay -clock clk  0.1  [get_ports {result[23]}]
set_output_delay -clock clk  0.1  [get_ports {result[22]}]
set_output_delay -clock clk  0.1  [get_ports {result[21]}]
set_output_delay -clock clk  0.1  [get_ports {result[20]}]
set_output_delay -clock clk  0.1  [get_ports {result[19]}]
set_output_delay -clock clk  0.1  [get_ports {result[18]}]
set_output_delay -clock clk  0.1  [get_ports {result[17]}]
set_output_delay -clock clk  0.1  [get_ports {result[16]}]
set_output_delay -clock clk  0.1  [get_ports {result[15]}]
set_output_delay -clock clk  0.1  [get_ports {result[14]}]
set_output_delay -clock clk  0.1  [get_ports {result[13]}]
set_output_delay -clock clk  0.1  [get_ports {result[12]}]
set_output_delay -clock clk  0.1  [get_ports {result[11]}]
set_output_delay -clock clk  0.1  [get_ports {result[10]}]
set_output_delay -clock clk  0.1  [get_ports {result[9]}]
set_output_delay -clock clk  0.1  [get_ports {result[8]}]
set_output_delay -clock clk  0.1  [get_ports {result[7]}]
set_output_delay -clock clk  0.1  [get_ports {result[6]}]
set_output_delay -clock clk  0.1  [get_ports {result[5]}]
set_output_delay -clock clk  0.1  [get_ports {result[4]}]
set_output_delay -clock clk  0.1  [get_ports {result[3]}]
set_output_delay -clock clk  0.1  [get_ports {result[2]}]
set_output_delay -clock clk  0.1  [get_ports {result[1]}]
set_output_delay -clock clk  0.1  [get_ports {result[0]}]
set_output_delay -clock clk  0.1  [get_ports busy]
set_output_delay -clock clk  0.1  [get_ports done]
